# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [7]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|')

In [8]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [9]:
users.groupby('occupation')['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [21]:
# Calculer le nombre total d'utilisateurs par profession
total_per_occupation = users.groupby('occupation').gender.count()

# Calculer le nombre d'hommes par profession
male_per_occupation = users[users.gender == 'M'].groupby('occupation').gender.count()

# Calculer le ratio d'hommes par profession
male_ratio = (male_per_occupation / total_per_occupation).sort_values(ascending=False)

male_ratio

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
Name: gender, dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [23]:
users.groupby('occupation').age.min()
users.groupby('occupation').age.max()

occupation
administrator    70
artist           48
doctor           64
educator         63
engineer         70
entertainment    50
executive        69
healthcare       62
homemaker        50
lawyer           53
librarian        69
marketing        55
none             55
other            64
programmer       63
retired          73
salesman         66
scientist        55
student          42
technician       55
writer           60
Name: age, dtype: int64

### Step 7. For each combination of occupation and gender, calculate the mean age

In [24]:
users.groupby(['occupation', 'gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [42]:
males_per_occupation = users[users['gender'] == 'M'].groupby('occupation').gender.count()
females_per_occupation = users[users['gender'] == 'F'].groupby('occupation').gender.count()

males_ratio = ((males_per_occupation / users.groupby('occupation').gender.count()) * 100).round()
females_ratio = ((females_per_occupation / users.groupby('occupation').gender.count()) * 100).round()

In [43]:
gender_ratio = pd.DataFrame({
    'Males': males_ratio,
    'Females': females_ratio
})
gender_ratio

               Males  Females
occupation
administrator   54.0     46.0
artist          54.0     46.0
doctor         100.0      NaN
educator        73.0     27.0
engineer        97.0      3.0
entertainment   89.0     11.0
executive       91.0      9.0
healthcare      31.0     69.0
homemaker       14.0     86.0
lawyer          83.0     17.0
librarian       43.0     57.0
marketing       62.0     38.0
none            56.0     44.0
other           66.0     34.0
programmer      91.0      9.0
retired         93.0      7.0
salesman        75.0     25.0
scientist       90.0     10.0
student         69.0     31.0
technician      96.0      4.0
writer          58.0     42.0